import styles from '@/Css/Greeting.module.css'
import { Link, useNavigate } from 'react-router-dom';
import SmoothScrolling from "@/SmoothScrolling/SmoothScrolling";

function Greeting() {
    const fading = SmoothScrolling();

    return (
        <div ref={fading} className={styles.greeting}>
            <div className={styles['greeting-title']}>
                <p data-translate="greetingTitle">შენი სახლური გემო</p>
            </div>
            <div className={styles['greeting-text']}>
                <p data-translate = "greetingText">ქართველი ხალხი განსაკუთრებული სიამაყით აღიარებს თავის კულინარიულ მემკვიდრეობას, და ქართული რესტორნები სწორედ ამის საუკეთესო მაგალითია. საქართველოში რესტორნები განსხვავებული სტილისა და თემატიკისაა, დაწყებული ტრადიციული სამზარეულოს სუფთებით დამთავრებული თანამედროვე გასტრონომიული ადგილებით, რომლებიც მსოფლიო ტენდენციებს ეხმიანება.
                    თბილისში, როგორც ქვეყნის კულინარიულ ცენტრში, მრავლად შეხვდებით რესტორნებს, რომლებიც სტუმრებს სთავაზობენ სხვადასხვა რეგიონის კერძებს. მაგალითად, სვანური კუბდარი, იმერული ხაჭაპური ან კახური შაშხი ხშირად არის მენიუს ცენტრში. ისტორიული უბნების რესტორნებში თქვენ შეგიძლიათ ისიამოვნოთ უძველესი რეცეპტებით მომზადებული კერძებით, რომლებიც უნიკალური არომატით გამოირჩევიან.
                    ბათუმში, შავი ზღვის სანაპიროზე, რესტორნები ხშირად აქცენტს აკეთებენ ზღვის პროდუქტებზე, ადგილობრივი თევზითა და ზღვის დელიკატესებით. რეგიონული სამზარეულო გამორჩეულია თავისი მრავალფეროვნებით, და ეს გამოიხატება ადგილობრივ რესტორნების სუფრებზე.
                    ქართული ღვინის ბარები და რესტორნები ასევე მნიშვნელოვანი ნაწილია ქართული კულტურის პოპულარიზაციის პროცესში. აქ შეგიძლიათ გასინჯოთ მრავალფეროვანი ღვინოები, რომლებიც რქაწითელისა და საფერავის ვაზისგან მზადდება.
                    ქართული რესტორნები არა მხოლოდ შესანიშნავ საკვებს სთავაზობენ, არამედ სტუმრებს ნამდვილ ქართულ გამოცდილებას აძლევენ – ტრადიციული მუსიკით, ცეკვებითა და განუმეორებელი სტუმართმოყვარეობით.</p>
            </div>
            <div className={styles['contuct-us']}>
                <Link to={'/ka/Contact'} className={styles['contact-link']}> 
                    <div data-translate = "contactUs">დაგვიკავშირდით</div>
                </Link>
            </div>
        </div>
    );
}
export default Greeting;